Revit 2027 API
ConicalSurface Class
 A Conical Surface.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Surface
 Autodesk.Revit.DB.ConicalSurface
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ConicalSurface : Surface
Public Class ConicalSurface
	Inherits Surface
public ref class ConicalSurface : public Surface
type ConicalSurface =
    class
        inherit Surface
    end
The ConicalSurface type exposes the following members.
Properties
Name | Description
Axis |  Axis of the cone. This is the Z axis of the local coordinate system associated with this cone.
HalfAngle |  Cone angle.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from Surface)
OrientationMatchesParametricOrientation |  Indicates whether this Surface's orientation is the same as or opposite to its parametric orientation.
(Inherited from Surface)
Origin |  Apex of the cone. This is the origin of the local coordinate system associated with this cone.
XDir |  X axis of the local coordinate system associated with this cone.
YDir |  X axis of the local coordinate system associated with this cone.
Top
Methods
Name | Description
Create |  Creates a conical surface defined by a local reference frame and a half angle.
Dispose
(Inherited from Surface)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetBoundingBoxUV |  Gets the UV bounding box of the surface.
(Inherited from Surface)
GetFrameOfReference |  Returns frame of reference associated with this ConicalSurface.
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
IsCoincidentWith |  Determine if two surfaces are coincident (ignoring Envelopes). For an affirmative answer, the surfaces must have the same type (e.g., two planes).
(Inherited from Surface)
IsValidConeAngle |  Checks whether the input value lies is not 0, greater than -PI/2 and lesser than PI/2.
Project |  Project a 3D point orthogonally onto a surface (to find the nearest point). Throws InvalidOperationException if the projection fails.
(Inherited from Surface)
ProjectWithGuessPoint |  Project a 3D point orthogonally onto a surface (to find the nearest point). This method is meant to be used when a good approximate solution for the projection is available. Throws InvalidOperationException if the projection fails.
(Inherited from Surface)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
Remarks
 The parametric equation of the cone is S(u, v) = center + v*[sin(halfAngle)(cos(u)*xVec + sin(u)*yVec) + cos(halfAngle)*zVec]. Only the branch of the cone with v >= 0 should be used.
See Also
Reference
Autodesk.Revit.DB Namespace